dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
			if( flash_mode != 3){
				flash_mode = 3; // All flashing
			}
			{
				int index = (flash_counter/8)%4;
				if(index<3){
					display_data =  ToBCD(work_hours[index]);
				}
				else {
					display_data = 0x0FF;
				}
			}
			break;
		case state_enter_service:
			display_data = service_mode|0xF0;
			flash_mode = 0;
			break;

		case state_clear_hours:
			flash_mode = 3;
			display_data = 0x00C;
			break;
		case state_address:
			flash_mode = 0;
			display_data = 0xA;
			break;
		case state_pre_time:
			flash_mode = 2;
			display_data = 0x3 | preset_pre_time;;
			break;
		case state_cool_time:
			flash_mode = 2;
			display_data = 0x4 | preset_cool_time;
			break;
		case state_ext_mode:
			flash_mode = 0;
			display_data = 0x5;
			break;
		}
//		show_digit(display_data);
		if (state == state_show_time){
			if(!pre_time && main_time){
				// turn on lamps
//				set_lamps(100);
//				set_licevi_lamps(100);
//				set_fan1(20);
//				set_fan2(100);
			} else	if(!pre_time && !main_time && cool_time){
//				set_lamps(0);
//				set_licevi_lamps(0);
//				set_fan1(100);
//				set_fan2(100);
				// turn on all coolers
			} else {
				// turn off all
				set_lamps(0);
				set_licevi_lamps(0);
				set_fan1(0);
				set_fan2(0);
				set_clima(0);
				state = state_set_time;
			}
		}
//
//		while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET); // wAIT UNTIL RX BUFFER IS EMPTY
//		int data =  USART_ReceiveData(USART1);
//		USART_SendData(USART1,0x80);
//				while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY


	}
}


void TIM3_IRQHandler() {
	if((TIM2->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
		TIM2->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
		if(TIM_ICInitStructure.TIM_ICPolarity == TIM_ICPolarity_Rising)
			TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Falling;
		else TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
		TIM_ICInit(TIM2, &TIM_ICInitStructure);
	}
	zero_crossed = 1;

}

int ToBCD(int value){
	int digits[3];
	int result;
	digits[0] = value %10;
	digits[1] = (value/10) % 10;
	digits[2] = (value/100) % 10;
	result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
	return result;
}

int FromBCD(int value){
	int digits[3];
	int result;
	digits[0] = value & 0x0F;
	digits[1] = (value>>4) & 0x0F;
	digits[2] = (value>>8) & 0x0F;
	result = digits[0] + digits[1]*10 + digits[2]*100;
	return result;
}


/**
 * @brief  Manage the activity on buttons
 * @param  None
 * @retval None
 */
void ProcessButtons(void)
{

	if (last_button < 0x1f){
		if(last_button != prev_button){
			switch(last_button){
			case BUTTON_START:
				if( pre_time ){
					//send_start();
					Gv_miliseconds = 0;
					pre_time = 0;
					state = state_show_time;
					update_status();
				}
				if(!pre_time && ! main_time && !cool_time) {
					if(time_to_set){
						// Send of time moved elsewhere
						pre_time = preset_pre_time;
						main_time = time_to_set;
						cool_time = preset_cool_time;
						state = state_show_time;
						time_to_set = 0;
						Gv_miliseconds = 0;
						update_status();
					} else {
						if (state > state_enter_service){
							// Write EEPROM
							if(state == state_clear_hours){
								work_hours[0] = 0;
								work_hours[1] = 0;
								work_hours[2] = 0;
							}
							write_eeprom();
							read_eeprom();
							start_counter = 0;
							service_mode = mode_null;
						} else {
							start_counter = START_COUNTER_TIME;
						}
						state = state_show_hours;
					}
				}


				break;
			case BUTTON_FAN1:
				selected_led_bits &= ~(LED_BUTTONS_MASK ^ LED_FAN1_L);
				selected_led_bits ^= LED_FAN1_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_FAN2:
//				selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_FAN2_L);
//				selected_led_bits ^= LED_FAN2_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_LICEVI:
				if(minute_counter){
					selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_LICEVI_L);
					selected_led_bits ^= LED_LICEVI_L;
				}
				auto_exit_fn = 20;
				break;
			case BUTTON_CLIMA:
				selected_led_bits &=  ~(LED_BUTTONS_MASK ^ LED_CLIMA_L);
				selected_led_bits ^= LED_CLIMA_L;
				auto_exit_fn = 20;
				break;
			case BUTTON_PLUS:
			{
				//				if(  led_bits){
				//					led_bits = led_bits <<1;
				//				} else {
				//					led_bits = 0x01;
				//				}
				auto_exit_fn = 20;

				if(state == state_show_hours) {
					state = state_set_time;
					start_counter = 0;
				}
				if(state == state_set_time){
					if(time_to_set < 25){
						if(!Gv_UART_Timeout)
							time_to_set ++;
						//			if((time_to_set & 0x0F)>9) time_to_set +=6;
					}
				}
				else if(state > state_enter_service){
					start_counter = EXIT_SERVICE_TIME;
					switch (service_mode){
					case mode_set_address:
						break;
					case mode_set_pre_time:
						if(preset_pre_time<9) preset_pre_time++;
						break;
					case mode_set_cool_time:
						if(preset_cool_time<9) preset_cool_time++;
						break;
					default:
						break;
					}
				} else {
					if(selected_led_bits & LED_FAN2_L){
						if(percent_fan2<100) percent_fan2=100;
						set_fan2(percent_fan2);
					} else if(selected_led_bits & LED_FAN1_L){
						if(percent_fan1<100) percent_fan1+=25;
						set_fan1(percent_fan1);
					} else if(selected_led_bits & LED_CLIMA_L){
						if(percent_clima<100) percent_clima=100;
						set_clima(percent_clima);
					}
				}




			}
			break;
			case BUTTON_MINUS:
				//				if(  led_bits){
				//					led_bits = led_bits >>1;
				//				} else {
				//					led_bits = 0x01 << 31;
				//				}
				auto_exit_fn = 20;

				if(state == state_show_hours) {
					state = state_set_time;
					start_counter = 0;
				}
				if(state == state_set_time){
					if(time_to_set) {
						if(!Gv_UART_Timeout) time_to_set--;
					}
				}else if(state > state_enter_service){
					start_counter = EXIT_SERVICE_TIME;
					switch (service_mode){
					case mode_set_address:
						break;
					case mode_set_pre_time:
						if(preset_pre_time) preset_pre_time--;
						break;
					case mode_set_cool_time:
						if(preset_cool_time) preset_cool_time--;
						break;
					default:
						break;
					}
				}
				if(selected_led_bits & LED_FAN2_L){
					if(percent_fan2) percent_fan2 = 0;
					set_fan2(percent_fan2);
				} else if(selected_led_bits & LED_FAN1_L){
					if(percent_fan1) percent_fan1-=25;
					set_fan1(percent_fan1);
				}
				else if(selected_led_bits & LED_LICEVI_L){
					if(percent_licevi) percent_licevi=0;
					set_licevi_lamps(percent_licevi);
					update_status();
				}

				break;
			default:
				while(0);
			}
			prev_button =  last_button;
		}
	} else {
		prev_button = last_button;
	}


	if (last_button == BUTTON_START)
	{
		// LED1_ON;
		if(start_counter< (START_COUNTER_TIME+ ENTER_SERVICE_DELAY + 6*SERVICE_NEXT_DELAY)) start_counter++;
		if(start_counter== START_COUNTER_TIME + ENTER_SERVICE_DELAY){
			if(curr_status == STATUS_FREE &&(state < state_enter_service))
			{
				state = state_enter_service;
				service_mode = mode_clear_hours; // Clear Hours
			}
		}
		if(state == state_enter_service){
			if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 1*SERVICE_NEXT_DELAY){
				service_mode = mode_set_address; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 2*SERVICE_NEXT_DELAY){
				service_mode = mode_set_pre_time; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 3*SERVICE_NEXT_DELAY){
				service_mode = mode_set_cool_time; //
			}
		}
		if(time_to_set && state == state_set_time && start_counter == START_DELAY){
			// Do start
			state = state_show_time;
//			send_time();
			//			start_counter = 0;
		}
		if(curr_status == STATUS_WAITING && start_counter == START_DELAY){
			// Cancel start
			state = state_show_time;
			time_to_set = 0;
			preset_pre_time = 0;
			preset_cool_time = 0;
//			send_time();
			read_eeprom();
			//			start_counter = 0;

